app/controllers/bloggers_controller.rb

  def index
    @bloggers = Blogger.all
---
SELECT "bloggers".* FROM "bloggers"

  def create
    @blogger = Blogger.new(blogger_params)

    respond_to do |format|
      if @blogger.save
---
INSERT INTO "bloggers" ("Name", "ArticleTitle", "ArticleBody", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["Name", "denis"], ["ArticleTitle", "hello world"], ["ArticleBody", "i didn t understand a lot"], ["created_at", "2021-03-03 08:06:02.066762"], ["updated_at", "2021-03-03 08:06:02.066762"]]

  def update
    respond_to do |format|
      if @blogger.update(blogger_params)
---
UPDATE "bloggers" SET "Name" = ?, "ArticleTitle" = ?, "ArticleBody" = ?, "updated_at" = ? WHERE "bloggers"."id" = ?  [["Name", "Denis"], ["ArticleTitle", "Pogrammer Denis"], ["ArticleBody", "Im the best"], ["updated_at", "2021-03-03 10:13:16.305152"], ["id", 2]]

  def destroy
    @blogger.destroy
---
DELETE FROM "bloggers" WHERE "bloggers"."id" = ?  [["id", 1]]

    def set_blogger
      @blogger = Blogger.find(params[:id])
---
SELECT "bloggers".* FROM "bloggers" WHERE "bloggers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]